# Пример решения задачи с применением этапов подготовки

## Задача

**Найти максимальное число в массиве.**

---

## 1. **Requirement Analysis (Анализ требований)**

- **Что нужно решить?** Найти максимальное число в заданном массиве.
- **Входные данные:** Массив чисел.
    - Например: `[1, 5, 2, 8, 3]`.
- **Выходные данные:** Максимальное число в массиве.
    - Например: `8`.
- **Ограничения:**
    - Массив может быть пустым (нужно обработать этот случай).
    - Все элементы массива — целые числа.

---

## 2. **Problem Decomposition (Декомпозиция задачи)**

1. Проверить, пуст ли массив.
2. Если массив не пустой:

- Пройти по всем элементам массива.
- Найти максимальное значение.

3. Вернуть результат.

---

## 3. **Algorithm Design (Проектирование алгоритма)**

Для задачи используется подход **"Brute Force"** (перебор всех элементов массива).

- Начальное значение максимума — первый элемент массива.
- Итерация по массиву для сравнения текущего максимума с каждым элементом.

---

## 4. **Pseudo-code Writing (Написание псевдокода)**

```plaintext
function findMax(array):
    if array is empty:
        return "Array is empty"
    max = array[0]
    for each element in array:
        if element > max:
            max = element
    return max
```

## 5. **Complexity Analysis (Анализ сложности)**

- **Time Complexity:** `O(n)` — необходимо пройти по всем элементам массива. Каждый элемент проверяется один раз,
  поэтому сложность линейная.
- **Space Complexity:** `O(1)` — используется только одна переменная для хранения текущего максимума, а массив не
  требует дополнительной памяти.

---

## 6. **Test Case Design (Проектирование тест-кейсов)**

1. **Simple Case:**

- Ввод: `[1, 5, 2, 8, 3]`
- Ожидаемый вывод: `8`

2. **Edge Case (Пустой массив):**

- Ввод: `[]`
- Ожидаемый вывод: `"Array is empty"`

3. **Edge Case (Один элемент):**

- Ввод: `[10]`
- Ожидаемый вывод: `10`

4. **Edge Case (Все элементы одинаковы):**

- Ввод: `[4, 4, 4]`
- Ожидаемый вывод: `4`

5. **Stress Case (Большой массив):**

- Ввод: `[1, 2, ..., 10^6]`
- Ожидаемый вывод: `10^6`

---

## 7. **Implementation (Реализация)**

```java
public class MaxFinder {
    public static String findMax(int[] array) {
        if (array.length == 0) {
            return "Array is empty";
        }
        int max = array[0];
        for (int num : array) {
            if (num > max) {
                max = num;
            }
        }
        return String.valueOf(max);
    }

    public static void main(String[] args) {
        int[] array = {1, 5, 2, 8, 3};
        System.out.println(findMax(array)); // Output: 8
    }
}
```


## 8. **Testing and Debugging (Тестирование и отладка)**

Протестируем следующие случаи:

1. **Простой случай:**
  - Ввод: `[1, 5, 2, 8, 3]`
  - Ожидаемый вывод: `8`

2. **Пустой массив:**
  - Ввод: `[]`
  - Ожидаемый вывод: `"Array is empty"`

3. **Один элемент:**
  - Ввод: `[10]`
  - Ожидаемый вывод: `10`

4. **Идентичные элементы:**
  - Ввод: `[4, 4, 4]`
  - Ожидаемый вывод: `4`

5. **Большой массив:**
  - Ввод: `[1, 2, ..., 10^6]`
  - Ожидаемый вывод: `10^6`

### Отладка:
- Проверяем на корректность логики (например, на пустые массивы).
- Отслеживаем поведение алгоритма на больших входных данных, чтобы проверить производительность.
- Если ошибка появляется в тестах, проводим пошаговую отладку для выявления проблемы.





